Feature: Filtering product

  Scenario Outline: Filter success
    Given "anonimous" user on the lamoda site "https://www.lamoda.ru/c/5971/shoes-muzhkrossovki/" page
    When set one "<filter-key>" and "<filter-value>" filter
    Then all products in search accordance "<description-key>" and "<filter-value>"
    Examples:
      | filter-key | description-key | filter-value |
#--------------------------МАТЕРИАЛЫ----------------------------#
      | Материалы  | Материал верха  | ПВХ          |
      | Материалы  | Материал верха  | Сустерра     |
      | Материалы  | Материал верха  | Акрил        |
      | Материалы  | Материал верха  | Велюр        |
      | Материалы  | Материал верха  | Замша        |

#--------------------------ЦВЕТ---------------------------------#
      | Цвет       | Цвет            | Бежевый      |
      | Цвет       | Цвет            | Белый        |
      | Цвет       | Цвет            | Бирюзовый    |
      | Цвет       | Цвет            | Желтый       |
      | Цвет       | Цвет            | Мультиколор  |

#--------------------------ВИД СПОРТА---------------------------#
      | Вид спорта  | Вид спорта     | Баскетбол     |
      | Вид спорта  | Вид спорта     | Бег           |
      | Вид спорта  | Вид спорта     | Велоспорт     |
      | Вид спорта  | Вид спорта     | Волейбол      |
      | Вид спорта  | Вид спорта     | Йога/танцы    |

#--------------------------СЕЗОН--------------------------------#
      | Сезон        | Сезон          | Демисезон    |
      | Сезон        | Сезон          | Зима         |
      | Сезон        | Сезон          | Лето         |
      | Сезон        | Сезон          | Мульти       |

#--------------------------БРЕНД--------------------------------#
      | Бренд      | Бренд           | 361              |
      | Бренд      | Бренд           | Abricot          |
      | Бренд      | Бренд           | adidas           |
      | Бренд      | Бренд           | adidas Originals |
      | Бренд      | Бренд           | adidas Y-3       |
